Conf.Simple/src/Enums/SUI_СостоянияДокументовОбмена/SUI_СостоянияДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияДокументовОбмена</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>КВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Загружен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Documents/SUI_ДокументОбмена/SUI_ДокументОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SUI_ДокументОбмена</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.SUI_ДополнительныеРеквизитыДокументовОбмена</registerRecords>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОснования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.SUI_ТипыДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСостояния</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/CommonModules/SUI_ДокументыОбмена/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

// SUI документы при записи (ДокументСсылка).
// 
// Параметры:
//  Источник - ДокументСсылка - Источник
//  Отказ - Булево - Отказ
Процедура SUI_ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	НастройкиПоДокументу = Справочники.SUI_НастройкиДокументовОбмена.НастройкиПоДокументу(Источник.Ссылка, , 
		Новый Структура("СоздаватьДокументОбменаПриЗаписиДокумента1С", Истина));
	
	Если НастройкиПоДокументу.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиДокументовОбмена.Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументовОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.SUI_ДокументОбмена КАК ДокументОбмена
		|		ПО ДокументОбмена.НастройкаДокумента = НастройкиДокументовОбмена.Ссылка
		|		И ДокументОбмена.ДокументОснование = &ДокументОснование
		|ГДЕ
		|	НастройкиДокументовОбмена.Ссылка В (&НастройкиПоДокументу)
		|	И ДокументОбмена.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДокументОснование", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Источник.Ссылка));
	Запрос.УстановитьПараметр("НастройкиПоДокументу", НастройкиПоДокументу);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки = Новый Структура();
	ПараметрыВыгрузки.Вставить("ДокументОснование", Источник.Ссылка);
	ПараметрыВыгрузки.Вставить("ПривилегированныйРежим", Истина);
	ПараметрыВыгрузки.Вставить("ВыполняетсяИзПодпискиНаСобытие");
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		ПараметрыВыгрузки.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("ПараметрыВыгрузкиДокументаОбмена", Новый Соответствие());
	
	ДанныеДляВыгрузки = Новый Структура();
	ДанныеДляВыгрузки.Вставить("ДоступенВыборДокументовОбмена", Ложь);
	ДанныеДляВыгрузки.Вставить("ВыбранныеДокументыОбмена", Новый ФиксированныйМассив(Новый Массив()));
	ДанныеДляВыгрузки.Вставить("ВыбранныеМобильныеУстройства", Неопределено);
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыВыгрузки.ПараметрыВыгрузкиДокументаОбмена.Вставить(Выборка.Ссылка, ДанныеДляВыгрузки);
	КонецЦикла;
	
	Если ПараметрыВыгрузки.Количество() > 0 Тогда
		
		#Если ВнешнееСоединение Тогда
			ВыгрузитьДокументОбменаВФоне(ПараметрыВыгрузки);
		#Иначе
			НаименованиеФЗ = СтрШаблон(НСтр("ru = '%1: Выгрузка в документ обмена при записи %2'"), 
				SUI_SimpleКлиентСервер.Представление(), Источник.Ссылка);
			ФоновыеЗадания.Выполнить("SUI_ДокументыОбмена.ВыгрузитьДокументОбменаВФоне", 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыВыгрузки), , НаименованиеФЗ);
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьДокументОбменаВФоне(ПараметрыВыгрузки, АдресРезультата = "") Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("СозданныеДокументыОбмена", Новый Массив());
	Результат.Вставить("ОбновленныеДокументыОбмена", Новый Массив());
	Результат.Вставить("ПропущенныеДокументыОбмена", Новый Массив());
	
	Если SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ПривилегированныйРежим", Ложь, Тип("Булево")) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого ПараметрВыгрузки Из ПараметрыВыгрузки.ПараметрыВыгрузкиДокументаОбмена Цикл
			
			Если ПараметрВыгрузки.Значение.ДоступенВыборДокументовОбмена И ПараметрВыгрузки.Значение.ВыбранныеДокументыОбмена.Количество() = 0 Тогда
				ТекстСообщения = НСтр("ru = 'По настройке ""%1"" и документу основанию ""%2"" необходимо выбрать документ обмена.
				|Выгрузка в документ обмена пропущена.'");
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, ПараметрВыгрузки.Ключ, ПараметрыВыгрузки.ДокументОснование));
				Продолжить;
			КонецЕсли;
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("ДокументОснование", ПараметрыВыгрузки.ДокументОснование);
			ДанныеЗаполнения.Вставить("НастройкаДокумента", ПараметрВыгрузки.Ключ);
			
			Если Не ПараметрыВыгрузки.Свойство("ВыполняетсяИзПодпискиНаСобытие") Тогда
				ДанныеЗаполнения.Вставить("Состояние", Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ДокументОбмена.Ссылка
				|ИЗ
				|	Документ.SUI_ДокументОбмена КАК ДокументОбмена
				|ГДЕ
				|	ДокументОбмена.Ссылка В (&ВыбранныеДокументыОбмена)
				|	И ДокументОбмена.НастройкаДокумента = &НастройкаДокумента
				|ДЛЯ ИЗМЕНЕНИЯ
				|	Документ.SUI_ДокументОбмена";
			
			Запрос.УстановитьПараметр("ВыбранныеДокументыОбмена", ПараметрВыгрузки.Значение.ВыбранныеДокументыОбмена);
			Запрос.УстановитьПараметр("НастройкаДокумента", ПараметрВыгрузки.Ключ);
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				ДокументОбмена = Документы.SUI_ДокументОбмена.СоздатьДокумент();
				
				ДокументОбмена.Заполнить(ДанныеЗаполнения);
				
				Если ДокументОбмена.ПроверитьЗаполнение() Тогда
					
					Если ПараметрыВыгрузки.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
						ДокументОбмена.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
					КонецЕсли;
					
					// Заполнить получателей для выгрузки
					Документы.SUI_ДокументОбмена.ЗаполнитьПолучателейОбменаДанными(ДокументОбмена,
						ПараметрВыгрузки.Значение.ВыбранныеМобильныеУстройства);
					
					ДокументОбмена.Записать(РежимЗаписиДокумента.Запись);
					
					Результат.СозданныеДокументыОбмена.Добавить(ДокументОбмена.Ссылка);
					
				КонецЕсли;
				
			ИначеЕсли Не ПараметрыВыгрузки.Свойство("ВыполняетсяИзПодпискиНаСобытие") Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ДокументОбмена = Выборка.Ссылка.ПолучитьОбъект();
					
					ДокументОбмена.Заполнить(ДанныеЗаполнения);
					
					Если ДокументОбмена.ПроверитьЗаполнение() Тогда
						
						Если ПараметрыВыгрузки.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
							ДокументОбмена.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
						КонецЕсли;
						
						// Заполнить получателей для выгрузки
						Документы.SUI_ДокументОбмена.ЗаполнитьПолучателейОбменаДанными(ДокументОбмена,
							ПараметрВыгрузки.Значение.ВыбранныеМобильныеУстройства);
						
						ДокументОбмена.Записать(РежимЗаписиДокумента.Запись);
						
						Результат.ОбновленныеДокументыОбмена.Добавить(Выборка.Ссылка);
						
					Иначе
						Результат.ПропущенныеДокументыОбмена.Добавить(Выборка.Ссылка);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			//TODO: 30.07.2024 - artem - Отправлять прогресс выполнения в длительной операции
//			ДлительныеОперации.СообщитьПрогресс(, , );
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия("ru = 'Выгрузка в документ обмена'"), ,
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, 
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ДокументОснование"), ИнформацияОбОшибке());
		ПолучитьСообщенияПользователю(Истина);
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДокументыОбменаВФоне(ДокументыОбменаКУдалению, АдресРезультата) Экспорт
	
	ТекущийДокументОбмена = Неопределено;
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДокументОбмена.Ссылка
			|ИЗ
			|	Документ.SUI_ДокументОбмена КАК ДокументОбмена
			|ГДЕ
			|	ДокументОбмена.Ссылка В (&ВыбранныеДокументыОбмена)
			|ДЛЯ ИЗМЕНЕНИЯ
			|	Документ.SUI_ДокументОбмена";
		
		Запрос.УстановитьПараметр("ВыбранныеДокументыОбмена", ДокументыОбменаКУдалению);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ТекущийДокументОбмена = Выборка.Ссылка;
				
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = '%1 удален.'"), ТекущийДокументОбмена));
				
				ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ДокументОбъект.Удалить();
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия("ru = 'Удаление документа обмена'"), ,
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, ТекущийДокументОбмена, ИнформацияОбОшибке());
		ПолучитьСообщенияПользователю(Истина);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
